
## Plan Result




<pre><code>Plan: 3 to add, 7 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.redis_connection_string
  * module.redis-ccd.azurerm_redis_cache.redis
  * module.redis-ccd.azurerm_resource_group.cache-resourcegroup
* Update
  * azurerm_application_insights.appinsights
  * azurerm_resource_group.rg
  * module.dm_store_storage_account.azurerm_storage_account.storage_account
  * module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
  * module.storage_account.azurerm_storage_account.storage_account
  * module.vault.azurerm_key_vault.kv
  * module.vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights will be updated in-place
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.Insights/components/ccd-aat"
        name                                  = "ccd-aat"
      ~ tags                                  = {
          ~ "contactSlackChannel" = "#ccd-questions-answers" -> "#ccd-community"
            # (6 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.redis_connection_string will be created
  + resource "azurerm_key_vault_secret" "redis_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat"
      + name                    = "ccd-redis-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat"
        name     = "ccd-shared-aat"
      ~ tags     = {
          ~ "contactSlackChannel" = "#ccd-questions-answers" -> "#ccd-community"
            # (8 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.dm_store_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      + cross_tenant_replication_enabled  = true
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.Storage/storageAccounts/dmstoredocaat"
        name                              = "dmstoredocaat"
      ~ tags                              = {
          - "Deployment Environment" = "aat" -> null
            # (9 unchanged elements hidden)
        }
        # (36 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # module.redis-ccd.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "ccd-redis-aat"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = (known after apply)
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "ccd-redis-cache-aat"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + subnet_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-1-aat"
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
          + "application"         = "core-case-data"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "staging"
          + "managedBy"           = "CCD"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 300
          + maxmemory_delta                 = 200
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 200
        }
    }

  # module.redis-ccd.azurerm_resource_group.cache-resourcegroup will be created
  + resource "azurerm_resource_group" "cache-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ccd-redis-cache-aat"
      + tags     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
          + "application"         = "core-case-data"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "staging"
          + "managedBy"           = "CCD"
        }
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.ServiceBus/namespaces/ccd-servicebus-aat"
        name                                = "ccd-servicebus-aat"
      ~ tags                                = {
          ~ "contactSlackChannel" = "#ccd-questions-answers" -> "#ccd-community"
            # (8 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      + cross_tenant_replication_enabled  = true
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.Storage/storageAccounts/ccdsharedaat"
        name                              = "ccdsharedaat"
      ~ tags                              = {
          - "Deployment Environment" = "aat" -> null
          ~ "contactSlackChannel"    = "#ccd-questions-answers" -> "#ccd-community"
            # (8 unchanged elements hidden)
        }
        # (36 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # module.vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat"
        name                            = "ccd-aat"
      ~ tags                            = {
          ~ "contactSlackChannel" = "#ccd-questions-answers" -> "#ccd-community"
            # (8 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat|ccd-aat"
        name                       = "ccd-aat"
        # (2 unchanged attributes hidden)


      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
        # (1 unchanged block hidden)
    }

Plan: 3 to add, 7 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_application_insights.appinsights has changed
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.Insights/components/ccd-aat"
        name                                  = "ccd-aat"
        tags                                  = {
            "BuiltFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
            "application"         = "core-case-data"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#ccd-questions-answers"
            "environment"         = "staging"
            "managedBy"           = "CCD"
        }
        # (15 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.app_insights_key has changed
  ~ resource "azurerm_key_vault_secret" "app_insights_key" {
        id                      = "https://ccd-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey/23d1d4a3621941c28915e6ce4d2ae3e0"
        name                    = "AppInsightsInstrumentationKey"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/AppInsightsInstrumentationKey/versions/23d1d4a3621941c28915e6ce4d2ae3e0"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/AppInsightsInstrumentationKey"
        tags                    = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.ccd-case-disposer-s2s-secret has changed
  ~ resource "azurerm_key_vault_secret" "ccd-case-disposer-s2s-secret" {
        id                      = "https://ccd-aat.vault.azure.net/secrets/ccd-case-disposer-s2s-secret/58cbfd8d20454743a435743828476f0b"
        name                    = "ccd-case-disposer-s2s-secret"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/ccd-case-disposer-s2s-secret/versions/58cbfd8d20454743a435743828476f0b"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/ccd-case-disposer-s2s-secret"
        tags                    = {}
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.ccd-next-hearing-date-updater-s2s-secret has changed
  ~ resource "azurerm_key_vault_secret" "ccd-next-hearing-date-updater-s2s-secret" {
        id                      = "https://ccd-aat.vault.azure.net/secrets/ccd-next-hearing-date-updater-s2s-secret/c0ba6971f86c4149bb8032fd087d10f5"
        name                    = "ccd-next-hearing-date-updater-s2s-secret"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/ccd-next-hearing-date-updater-s2s-secret/versions/c0ba6971f86c4149bb8032fd087d10f5"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/ccd-next-hearing-date-updater-s2s-secret"
        tags                    = {}
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.ccd_gw_s2s_secret has changed
  ~ resource "azurerm_key_vault_secret" "ccd_gw_s2s_secret" {
        id                      = "https://ccd-aat.vault.azure.net/secrets/ccd-gw-s2s-secret/9bbbcf7aee8147dfadf763bdd61109d5"
        name                    = "ccd-gw-s2s-secret"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/ccd-gw-s2s-secret/versions/9bbbcf7aee8147dfadf763bdd61109d5"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/ccd-gw-s2s-secret"
        tags                    = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.dm_store_storageaccount_id has changed
  ~ resource "azurerm_key_vault_secret" "dm_store_storageaccount_id" {
        id                      = "https://ccd-aat.vault.azure.net/secrets/dm-store-storage-account-id/b76343af97574557928d3ee00aed8e68"
        name                    = "dm-store-storage-account-id"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/dm-store-storage-account-id/versions/b76343af97574557928d3ee00aed8e68"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/dm-store-storage-account-id"
        tags                    = {}
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.dm_store_storageaccount_primary_access_key has changed
  ~ resource "azurerm_key_vault_secret" "dm_store_storageaccount_primary_access_key" {
        id                      = "https://ccd-aat.vault.azure.net/secrets/dm-store-storage-account-primary-access-key/00c26a7be8f04bdcb88dcbd1a057af40"
        name                    = "dm-store-storage-account-primary-access-key"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/dm-store-storage-account-primary-access-key/versions/00c26a7be8f04bdcb88dcbd1a057af40"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/dm-store-storage-account-primary-access-key"
        tags                    = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.dm_store_storageaccount_primary_connection_string has changed
  ~ resource "azurerm_key_vault_secret" "dm_store_storageaccount_primary_connection_string" {
        id                      = "https://ccd-aat.vault.azure.net/secrets/dm-store-storage-account-primary-connection-string/fb520aa38dc14150bb2bb1b2b9b2aaec"
        name                    = "dm-store-storage-account-primary-connection-string"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/dm-store-storage-account-primary-connection-string/versions/fb520aa38dc14150bb2bb1b2b9b2aaec"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/dm-store-storage-account-primary-connection-string"
        tags                    = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.dm_store_storageaccount_secondary_access_key has changed
  ~ resource "azurerm_key_vault_secret" "dm_store_storageaccount_secondary_access_key" {
        id                      = "https://ccd-aat.vault.azure.net/secrets/dm-store-storage-account-secondary-access-key/7594863896284e789d5f0ae35b5a3d3c"
        name                    = "dm-store-storage-account-secondary-access-key"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/dm-store-storage-account-secondary-access-key/versions/7594863896284e789d5f0ae35b5a3d3c"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/dm-store-storage-account-secondary-access-key"
        tags                    = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.dm_store_storageaccount_secondary_connection_string has changed
  ~ resource "azurerm_key_vault_secret" "dm_store_storageaccount_secondary_connection_string" {
        id                      = "https://ccd-aat.vault.azure.net/secrets/dm-store-storage-account-secondary-connection-string/f8618ece344d48609cf8acc658dbaeca"
        name                    = "dm-store-storage-account-secondary-connection-string"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/dm-store-storage-account-secondary-connection-string/versions/f8618ece344d48609cf8acc658dbaeca"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/dm-store-storage-account-secondary-connection-string"
        tags                    = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.storageaccount_id has changed
  ~ resource "azurerm_key_vault_secret" "storageaccount_id" {
        id                      = "https://ccd-aat.vault.azure.net/secrets/storage-account-id/f766c45f8fe4414e9d014f810bbf0adf"
        name                    = "storage-account-id"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/storage-account-id/versions/f766c45f8fe4414e9d014f810bbf0adf"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/storage-account-id"
        tags                    = {}
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.storageaccount_primary_access_key has changed
  ~ resource "azurerm_key_vault_secret" "storageaccount_primary_access_key" {
        id                      = "https://ccd-aat.vault.azure.net/secrets/storage-account-primary-access-key/3379d4119a48455aa4cdbdc4ed28048b"
        name                    = "storage-account-primary-access-key"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/storage-account-primary-access-key/versions/3379d4119a48455aa4cdbdc4ed28048b"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/storage-account-primary-access-key"
        tags                    = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.storageaccount_primary_connection_string has changed
  ~ resource "azurerm_key_vault_secret" "storageaccount_primary_connection_string" {
        id                      = "https://ccd-aat.vault.azure.net/secrets/storage-account-primary-connection-string/da4171713065416f84044691f76fc493"
        name                    = "storage-account-primary-connection-string"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/storage-account-primary-connection-string/versions/da4171713065416f84044691f76fc493"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/storage-account-primary-connection-string"
        tags                    = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.storageaccount_secondary_access_key has changed
  ~ resource "azurerm_key_vault_secret" "storageaccount_secondary_access_key" {
        id                      = "https://ccd-aat.vault.azure.net/secrets/storage-account-secondary-access-key/04bd425fedd841d8a0e2bb5a863ab62e"
        name                    = "storage-account-secondary-access-key"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/storage-account-secondary-access-key/versions/04bd425fedd841d8a0e2bb5a863ab62e"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/storage-account-secondary-access-key"
        tags                    = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.storageaccount_secondary_connection_string has changed
  ~ resource "azurerm_key_vault_secret" "storageaccount_secondary_connection_string" {
        id                      = "https://ccd-aat.vault.azure.net/secrets/storage-account-secondary-connection-string/49a98e17c4304ab8a194fef5aaf7658a"
        name                    = "storage-account-secondary-connection-string"
      + resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/storage-account-secondary-connection-string/versions/49a98e17c4304ab8a194fef5aaf7658a"
      + resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat/secrets/storage-account-secondary-connection-string"
        tags                    = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.dm_store_storage_account.azurerm_storage_account.storage_account has changed
  ~ resource "azurerm_storage_account" "storage_account" {
      + default_to_oauth_authentication   = false
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.Storage/storageAccounts/dmstoredocaat"
        name                              = "dmstoredocaat"
      + public_network_access_enabled     = true
      + sftp_enabled                      = false
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
            "Deployment Environment" = "aat"
            "Destroy Me"             = "No"
            "Team Contact"           = "#em-dev-chat"
            "application"            = "evidence-management"
            "businessArea"           = "CFT"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#em-dev-chat"
            "environment"            = "staging"
            "managedBy"              = "Evidence Management"
        }
        # (33 unchanged attributes hidden)

      ~ blob_properties {
          + change_feed_retention_in_days = 0
            # (3 unchanged attributes hidden)



          + restore_policy {
              + days = 364
            }
            # (2 unchanged blocks hidden)
        }



      + share_properties {
        }

        # (3 unchanged blocks hidden)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace has changed
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.ServiceBus/namespaces/ccd-servicebus-aat"
      + minimum_tls_version                 = "1.0"
        name                                = "ccd-servicebus-aat"
      + public_network_access_enabled       = true
        tags                                = {
            "BuiltFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
            "Destroy Me"          = "No"
            "Team Contact"        = "#ccd-devops"
            "application"         = "core-case-data"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#ccd-questions-answers"
            "environment"         = "staging"
            "managedBy"           = "CCD"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.storage_account.azurerm_storage_account.storage_account has changed
  ~ resource "azurerm_storage_account" "storage_account" {
      + default_to_oauth_authentication   = false
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.Storage/storageAccounts/ccdsharedaat"
        name                              = "ccdsharedaat"
      + public_network_access_enabled     = true
      + sftp_enabled                      = false
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
            "Deployment Environment" = "aat"
            "Destroy Me"             = "No"
            "Team Contact"           = "#ccd-devops"
            "application"            = "core-case-data"
            "businessArea"           = "CFT"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#ccd-questions-answers"
            "environment"            = "staging"
            "managedBy"              = "CCD"
        }
        # (33 unchanged attributes hidden)

      ~ blob_properties {
          + change_feed_retention_in_days = 0
            # (3 unchanged attributes hidden)



          + restore_policy {
              + days = 364
            }
            # (2 unchanged blocks hidden)
        }



      + share_properties {
        }

        # (3 unchanged blocks hidden)
    }

  # module.vault.azurerm_key_vault.kv has changed
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat"
        name                            = "ccd-aat"
      + public_network_access_enabled   = true
        tags                            = {
            "BuiltFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
            "Destroy Me"          = "No"
            "Team Contact"        = "#ccd-devops"
            "application"         = "core-case-data"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#ccd-questions-answers"
            "environment"         = "staging"
            "managedBy"           = "CCD"
        }
        # (12 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat|ccd-aat"
        name                       = "ccd-aat"
        # (2 unchanged attributes hidden)

      + enabled_log {
          + category = "AuditEvent"

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":159,"Program":"tfcmt","SHA1":"","Vars":{}} -->